Autodesk.Revit.DB.CutFailureReason
The reason why a solid-solid cut cannot be created.
Since:
2012
Since:
2012

Autodesk.Revit.DB.CutFailureReason.CutNotAppropriateForElements
The cut is not appropriate for the two elements.

Autodesk.Revit.DB.CutFailureReason.OppositeCutExists
The target element has already cut the cutting element.

Autodesk.Revit.DB.CutFailureReason.CutAlreadyExists
The cutting element has already cut the target element.

Autodesk.Revit.DB.CutFailureReason.CutAllowed
Yes, the cutting element can add a cut to the target element.